reports/ab_n_500_c_20/flask_tf_serving|hello_world.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        gunicorn/20.0.4
Server Hostname:        127.0.0.1
Server Port:            5050

Document Path:          /hello_world
Document Length:        18 bytes

Concurrency Level:      40
Time taken for tests:   3.117 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      850000 bytes
HTML transferred:       90000 bytes
Requests per second:    1604.04 [#/sec] (mean)
Time per request:       24.937 [ms] (mean)
Time per request:       0.623 [ms] (mean, across all concurrent requests)
Transfer rate:          266.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     1   25  19.0     19     140
Waiting:        1   23  18.7     17     139
Total:          2   25  19.0     20     140

Percentage of the requests served within a certain time (ms)
  50%     20
  66%     28
  75%     34
  80%     39
  90%     50
  95%     62
  98%     78
  99%     89
 100%    140 (longest request)